{"data":{"site":{"siteMetadata":{"title":"הבלוג של יותם","author":"יותם וקנין"}},"markdownRemark":{"id":"c23c0e59-83b1-5326-9fd0-e606d4e67d5f","excerpt":"חלק שני - קוונטיזציה, קוונטיזציה שניה, קוונטיזציה n…","html":"<h2>חלק שני - קוונטיזציה, קוונטיזציה שניה, קוונטיזציה n-ית ושטויות אחרות</h2>\n<p>קוונטיזציה היא תהליך של הפיכת תורה קלאסית לתורה קוונטית.</p>\n<p>בחלק הבא, אני מתכוון לדבר על ״קוונטיזציה שניה״. ״קוונטיזציה שניה״ היא בכלל לא צורה של קוונטיזציה, ולטעמי ראוי היה לקרוא לה ״בחירה לא איומה של מרחב ההילברט שלך״. אבל היא נקראת ״קוונטיזציה שניה״. אז כדי שתאמינו לי שבאמת לא מדובר בתהליך של קוונטיזציה, אנחנו צריכים להבין ביחד מה תהליך של קוונטיזציה כן כולל.</p>\n<p>נזכר לרגע במכניקה המילטונית קלאסית. מכניקה המילטונית (שגם עליה אכתוב ביום מן הימים) משתמשת בלגרניזאן כדי להגדיר את התנע P, ואת ההמילטוניאן H, ומספרת לנו שמשוואות התנועה של הגדלים האלה הן:</p>\n<p>== משוואות המילטון==</p>\n<p>כאשר ההמילטוניאן הוא גודל שתלוי ב-P ו-Q. בגלל הסימטריה היפה של המשוואות האלו, אפשר להגדיר את סוגרי פואסון:</p>\n<p>== הגדרה של סוגרי פואסון ==</p>\n<p>הגדרה שמרגישה מעט תמוה במבט ראשון, אבל אם מציבים כל פונקציה שתלויה במיקום Q ובתנע P בתוך סוגרי פואסון מקבלים:</p>\n<p>== גזירה של אופרטור בזמן עם סוגרי פואסון ==</p>\n<p>מקסים! לסוגרי פואסון יש כמה כללי אלגברים נוספים שהופכים אותם לכלי מאוד אלגנטי לחקור מערכות שיש להן המילטוניאן ותלויות בגדלים מורכבים. אני עוצר את עצמי ומשאיר את הפרטים לכתבה אחרת. הזהות היחידה שתהיה חשובה עבורנו היא הזהות הבאה:</p>\n<p>== סוגרי פואסון על תנע ומקום עם ההמילטוניאן ==</p>\n<p>ונשיב לב לסימטריה הנחמדה הזו, שתהיה שימושית אח״כ.</p>\n<h3>חזרה לקוונטים</h3>\n<p>כשאייזנברג ניסה לקוונטת את הטבע, הוא כלל לא חשב על ווקטורים במרחב הילברט. אייזנברג בחר בכלל להסתכל על האופרטורים, וניסה לחשב כיצד הם מתקדמים בזמן. אבל מה זה אומר בכלל שאופרטורים מתקדמים בזמן? אתם שואלים ובצדק. נשים לב למשוואה הבאה:</p>\n<p>== קידום בזמן של אופרטור ==</p>\n<p>נשים לב שהמשוואה הזו יכולה להתפרש בשני אופנים. הראשון והסטנדרטי, שנקרא תמונת שרדינגר, היא לומר שווקטור המצב מתקדם בזמן, והאופרטור נותר קבוע. בכל רגע אפשר להשתמש באופרטור כדי למדוד את ערך התצפית, על ידי ״סגירה״ שלו עם ווקטור המצב ברגע הנכון.</p>\n<p>אבל בגלל שהווקטורים שלנו הם אוביקטים יחסית מופשטים, לא ברור מאליו שמי שמתקדם בזמן הוא הווקטור. איזנברג חשב על האופרטורים כאובייקט שמשתנה עם הזמן, ולכן משוואת הקידום בזמן שלו היא משוואת אייזנברג:</p>\n<p>== משוואת הייזנברג ==</p>\n<p>או בגרסה אינפיניטיסימאלית:</p>\n<p>== קומוטטור ==</p>\n<p>כדי להוכיח אותה, בוחרים t קטן ופותחים את האקספוננט לטור. קשה שלא להבחין בדימיון בין המשוואה הזו למשוואה שכתבנו למעלה עם סוגרי פואסון, כאשר ההבדל הוא בדיוק ה-i שמתאר את ההתקדמות הקוונטית. קשה לפספס את הדימיון הזה, אבל בגלל שסוגרי פואסון והקומוטטור הם אובייקטים כל כך שונים, לא ברור שיש דרך לקשר בין שתי התוצאות הללו.</p>\n<p>לעזרתנו נחלצת הזהות האלגברית הבאה, שנכונה לאופרטורים P,Q שהקומוטטור שלהם הוא סקאלר:</p>\n<p>== זהות אלגברית על קומוטטורים ==</p>\n<p>ההוכחה שלה יחסית פשוטה, והיא כוללת לפתוח את הפונקציה לטור באופרטורים Q,P. אני אכתוב אותה במפורש בכתבה נפרדת כדי לא להסיח את דעתנו.</p>\n<p>המילטוניאן של אופרטורים</p>\n<p>נשוב רגע לעסוק במשוואות המילטון של מערכת שתהיה לכאורה קלאסית. נניח שיש לנו המילטוניאן H שתלוי ב-P,Q, אבל עתה נניח שהם אופרטורים במקום ווקטורים, ונניח שעדיין מתקיימות עבורם משוואות המילטון. אין סיבה שלא לעשות את זה. הגזירה לפי אופרטורים עלולה להרגיש קצת מלוכלכת, אבל להגדיר אותה בצורה סבירה זה תהליך פשוט שלא צריך להסיח את דעתנו. אז נשים לב שקיבלנו עבור האופרטורים שלנו:</p>\n<p>== משוואות המילטון עם סוגרי פואסון ==</p>\n<p>כתלות באופרטורים שלנו, הן יקיימו יחס חילוף כזה או אחר, ותאוריות שונות יכילו אופרטורים שונים עם יחסי חילוף שונים. אם נניח לרגע שיש לנו שליטה באופרטורים שמתארים את התאוריה שלנו, ונבחר את האופרטורים שלנו כך שהם יקיימו:</p>\n<p>== קשר בין יחס חילוף לסוגרי פואסון ==</p>\n<p>נקבל מיד שמשוואת התנועה של האופרטורים היא:</p>\n<p>== משוואות תנועה לאופרטורים ==</p>\n<p>זה עלול להזכיר מעט את משפט ארנספט (לינק). למי שלא זוכר, משפט ארנפסט מתאר איך הממוצע של אופרטורי המקום והתנע משתנה בזמן, והם מקיימים:</p>\n<p>== משפט ארנפסט ==</p>\n<p>אבל חשוב לשים לב שפה לא מדובר בכלל על ערכי תצפית, אלא על הקידום בזמן של האופרטורים ממש! האופרטורים מקיימים משוואות תנועה קלאסיות, בנוסף לעובדה שהם מקיימים את משוואת הייזנברג! המערכת שלנו היא קלאסית וקוונטית באותו הזמן!</p>\n<p>אני מקווה שאתם מתרגשים כמו שאני מתרגש. מכלל פשוט מאוד - הגדרה נכונה של יחסי החילוף, וניצול זהויות אלגבריות ממבניים מתמטיים מאוד שונים (סוגרי פואסון על מרחב הפאזה, קומוטטור על אופרטורים לינארים במרחב הילברט), קיבלנו במתנה תאוריה שהיא גם קוונטית וגם קלאסית באותו הזמן.</p>\n<p>וזו היא המשמעות של לקוונטת תאוריה. אנחנו לקחנו תאוריה של מספרים קלאסים, והפכנו אותה לתאוריה של אופרטורים שמתקדמים בזמן באמצעות בדיוק אותן משוואות תנועה. המשוואות הקלאסיות היו משוואות של ווקטורים, והמשוואות עתה מתארות אופרטורים, אבל מדובר באותן משוואות תנועה. בנוסף למשוואות התנועה הקלאסיות, האופרטורים שלנו מקיימים את משוואות התנועה הקוונטיות (משוואת הייזנברג\\שרדינגר).</p>\n<p>האם יש שימור אנרגיה? כן! איך נוכל לראות את זה? אנחנו יודעים שמשוואות התנועה הקלאסיות מבטיחות שימור אנרגייה, ומשום שהמערכת הקוונטית מקייימת את אותן משוואות, אז יש שימור אנרגיה. האם יש שימור תנע? נסו לענות על השאלה הזו בעצמכם. שימו לב שאין צורך לחשוב על שיקולים קוונטים, כי כל הידע הקלאסי נותר, בגלל שמשוואות התנועה נותרו. אז אם יש שימור תנע או לא, הופכת לשאלה קלאסית.</p>\n<p>אם לצטט לרגע את דיראק:</p>\n<blockquote>\n<div class='english'>\"The correspondence between the quantum and classical theories lies not so much in the limiting agreement when $h \\\\rightarrow 0$ as much as in the fact that the mathematical operations on the two theories obey in many cases the same laws\"\n<p>-Paul Dirac 1925’The fundamental equations of quantum mechanics’</div></p>\n</blockquote>\n<p>תהליך הקוונטיזציה שתראנו לא מתאים לכל מערכת קוונטית. ספין היא דוגמה למערכת שאין לה אנלוגיה קלאסית, ולכן אפשר לטעון שהיא לא עברה קוונטיזציה. אף על פי כן, קיימות משוואות גלים קלאסיות שמתארות ספין, וגם את משוואות הגלים האלו אפשר להעביר תהליך של קוונטיזציה ולקבל תורה קוונטית שמתארת ספין. זו בדיוק משוואת דיראק. אבל אני סוטה מהנושא.</p>\n<p>אני ביקשתי שנניח שיש לנו יכולת לשלוט ביחסי החילוף של האופרטורים שלנו. האם יש לנו יכולת לשלוט בהם? סביר לומר שלא. אופרטור התנע והמקום הם פשוט אופרטורים ש״קיימים״ בכל מרחב הילברט ובכל יקום, ואין לנו יכולת להחליט איך הם נראים. זו התוספת האינטלקטואלית של תהליך הקוונטיזציה. קוונטיזציה היא בחירה מחוכמת של אופרטורים בתאוריה, כדי שהם יקיימו את יחס החילוף שיתאר את הטבע הקלאסי והקוונטי יחדיו.</p>\n<p>נסיים פה את הדיון בקוונטיזציה. בכתבה הבאה אנחנו נלמד על קוונטיזציה שניה. זה יהיה דיון קצר ואלגנטי, שפיסיקאים מקצועיים יוכלו לדלג עליו , ולקפוץ ישר לכתבה האחרונה - מה זו תורת השדות הקוונטית?</p>","frontmatter":{"title":"מבוא לתורת השדות חלק ב׳","date":"April 28, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/QFT-part-2/","previous":{"fields":{"slug":"/QFT-part-1/"},"frontmatter":{"title":"מבוא לתורת השדות חלק א׳"}},"next":null}}