{"data":{"site":{"siteMetadata":{"title":"הבלוג של יותם","author":"יותם וקנין"}},"markdownRemark":{"id":"5cf47769-2995-5d7d-a0d3-c8714ce977ac","excerpt":"…","html":"<h2>הקדמה</h2>\n<p>על אף פי שתורת השדות היא הצורה הכי יפה של תורת הקוונטים, נדיר שסטודנטים לתואר ראשון ואפילו שני מבינים עד הסוף איך בדיוק היא עובדת. במקום ללמוד לחשב אמפליטודות פיזור, אני רוצה לענות לפיסיקאי המנוסה והלא מנוסה על כמה שאלות לגבי QFT:</p>\n<ul>\n<li>למה זה רעיון טוב?</li>\n<li>למה זו באמת הדרך היחידה לאחד בין קוונטים ליחסות פרטית?</li>\n<li>עכשיו כשהבנו, איך בכלל היא עובדת?</li>\n</ul>\n<p>קורסים בתורת השדות מתחילים כמעט מיד בביטויים כמו:</p>\n<p>$$ \\psi= \\int \\frac{d^3 p}{(2 \\pi)^3} \\frac{1}{\\sqrt{2 \\omega}} \\left[ \\hat{a}<em>p e^{ipx}+\\hat{a}^{\\dagger}</em>{p} e^{-ipx} \\right]$$</p>\n<p>שצצים להם כמעט משום מקום. זה מעודד כל צופה לאבד את היכולת לנסות להבין משהו, וכל חישוב שמגיע אחר כך הוא לעיתים קרובות לא יותר מהעברת סימנים ממקום למקום.</p>\n<p>הפוסטים האלה מתאימים למי שזה הרגע סיים קורס ראשון בתורת הקוונטים. אני מקווה שלאורך הקריאה אתם תבינו מספיק כדי שתוכלו לעצור פתאום ולכתוב בעצמכם את ההמשך, כמו שעשה פיינמן לפניכם, אבל גם לעבור את התהליך בצורה פסיבית זו חוויה נחמדה. לקוראים שכבר עשו קורס אחד או שניים בתורת השדות - אתם הקהל המרכזי שלי! קורסים בתורת השדות עושים עוול למקצוע, ואני רוצה לנסות לתקן אותו כאן.</p>\n<p>אז ברוכים הבאים! בואו נתחיל.</p>\n<h2>חלק ראשון - מה זו תורה יחסותית, ומה זו תורה קוונטית</h2>\n<p>בחלק הראשון הזה אני רוצה לנסות להבין מה בדיוק מאפיין תורה יחסותית ותורה קוונטית. כשנצליח לתאר בצורה מדוייקת את זוג המושגים האלו, שאר הדרך תעשה ברורה הרבה יותר. בחלק השני נדבר על קוונטיזציה, בחלק השלישי על “קוונטיזציה שניה”, ובחלק הרביעי נאסוף הכל ביחד ונקבל תורת שדות. אז בואו נתחיל מלהבין מה זו תורה קוונטית:</p>\n<h3>תורה קוונטית</h3>\n<blockquote>\n<p>“I am aware that this formulation is not entirely unambiguous”\n-שרדינגר בהערת שוליים למאמר שבו פרסם לראשונה את משוואת שרדינגר, ואת הפתרון של אטום המימן.</p>\n</blockquote>\n<p>עבורנו, תורה קוונטית היא כל תורה שמתרחשת במרחב הילברט, כלומר מרחב ווקטורי עם מכפלה פנימית, שבה <strong>מצבים (ווקטורים במרחב הילברט) צוברים פאזה לפי האנרגיה שלהם</strong>. ראוי להוסיף גם הנחה לגבי הסתברוית ומדידות שעליה לא נפרט כרגע, אבל היא זהה ב-QFT. העובדה שמצבים במרחב הילברט צוברים פאזה לפי אנרגיה שלהם, או יותר נכון:</p>\n<p>==משוואת שרודינג התלויה בזמן.==</p>\n<p>היא התכונה שמאפיינת תורות קוונטיות. מבחינתנו, כל תורה שיש בה מרחב ווקטורי ומגדירה איך ווקטורים משתנים בזמן היא תורה קוונטית. השאלה שנותרת היא רק מה המרחב, או במילים אחרות, אילו מצבים אפשר למדוד, ואיך הם מתקדמים בזמן - כלומר מה ההמילטוניאן.</p>\n<p>אז זה בעצם האתגר שלנו: למצוא מרחב הילברט והמילטוניאן שישמרו על העקרונות של תורת היחסות הפרטית. אם נעשה זאת בצורה הנכונה, התהליך יהיה כמעט טריוויאלי, ובאמת בקורסים בתורת השדות למצוא תאוריות יחסותיות הופך לספורט שמשמש לכתיבת מבחנים, ופיסיקאים תאורטיים מבלים קריירות שלמות בכתיבה של תאוריות כאלו.</p>\n<p>הפיסיקאי הראשון שהצליח לכתוב תאוריה שמתאימה לדרישות שלנו היה יקיר המערכת פול דיראק, ש(-כמובן-)עשה זאת באמצעות ניחוש מושכל מאוד. לפרטים של משוואת דיראק לא יהיה עבורנו הרבה ערך, ואני מקווה לכתוב עליה כתבה מסודרת ביום מן הימים. אבל מה שדיראק הצליח לעשות היה למצוא המילטוניאן שמקיים את הדרישה:</p>\n<p>== יחס אנרגיה תנע יחסותי ==</p>\n<p>כאשר האנרגיה והתנע במשוואה הזו הם אופרטורים (ולא סקלרים או ווקטורים). אבל חשוב להבין שתאוריה ששומרת על היחס הזה, לאו דווקא מבטיח לנו שהיא גם יחסותית, מה שמוביל אותי לנושא הבא שלנו:</p>\n<h3>תאוריה יחסותית</h3>\n<p>בכל תאוריה יש גדלים שעוברים בצורות שונות בין מערכות ייחוס. תורת היחסות הפרטית מגדירה לנו מה מערכות הייחוס ה״מותרות״, שהן כל המערכות ייחוס שאפשר ״להגיע״ אליהן עם טרנס׳ לורנץ. לכל אובייקט יהיו כללי טרנספורמציה שונים בתורת היחסות הפרטית: טמפרטורה היא גודל שלא משתנה בין מערכות ייחוס, אנרגיה משתנה בצורה אחת, תנע בצורה אחרת. לכל גודל יש כלל טרנספורמציה משלו.</p>\n<p>מה שמאפיין תאוריה יחסותית הוא <strong>שמשוואות התנועה לא משתנות בין מערכות ייחוס</strong>. כמעט כל הגדלים עוברים בין מערכות הייחוס בצורה לא טריוויאלית, אבל תאוריה יחסותית היא תאוריה שבה כל מערכת ייחוס משתמש באותן משוואות דיפרנציאליות כדי לגלות איך נראה העתיד.</p>\n<p>נדגים זאת באמצעות דוגמה קצת ספקולטיבית: נניח שאנחנו מודדים במעבדה גודל חדש שלא נמדד קודם ומאפיין בצורה מסובכת מאוד את ההתנהגות של חלקיקים. נקרא לגודל הזה ״חמפרפור״. החמפרפור של חלקיק הוא ווקטור במרחב 5 מימדי מרוכב (או משהו…), ויש משוואה דיפרנציאלית שמתארת איך הוא משתנה בזמן עבור כל חלקיק. המשוואה מאוד מסובכת, ותלויה, איך לא, בתנע של החלקיק, במיקום שלו, ובכיוון הספין של החלקיק ביחס לירח. או משהו. למי אכפת.</p>\n<p>הגדלים שמשפיעים על המשוואה הדיפרנציאלית הזו (תנע, מיקום, כיוון ספין ביחס לירח) הם גדלים שמשתנים בין מערכות ייחוס שונות. יכול להיות שהם מסתדרים להם היטב כך שהמשוואה הדיפרנציאלית שכתבנו לחמפרפור נשארת בדיוק כמו שהיא אחרי שהעברנו את כל הפרמטרים האלה למערכת הייחוס החדשה, ואם כן, אז חמפרפור זה גודל שמור בין מערכות ייחוס. הידד!</p>\n<p>אבל יכול להיות שלא, ויכול להיות שכדי שהחמפרפור ימשיך לקיים בדיוק את אותה משוואה דיפרנציאלית, צריך גם לשנות אותו בין מערכות ייחוס. אנחנו נקרא לאופן שבו צריך לשנות את הווקטור ה-5 מימדי שלנו שמייצג את החמפרפור ״כלל הטרנספורמציה של חמפרפור תחת טרנספורמצית לורנץ״, או בשפה המקצועית ״ההצגה של חמפרפור בחבורת לורנץ״. השמות האלו נשמעים מרשימים מאוד עם המילה חמפרפור בפנים, אבל המשמעות היא ברורה - איך אנחנו מוודאים שאפשר לקדם את חמפרפור בזמן במערכת ייחוס אחת, או לקדם אותו באחרת, וכשנעבור בניהן כולם יסכימו על ערך החמפרפור של החלקיק. נשים לב שמדובר בדרישה מאוד מגבילה, כי <strong>המשוואה הדיפרנציאלית עצמה חייבת להיות זהה בשתי המערכות</strong>. חוקי הטבע לא משתנים בין מערכות ייחוס.</p>\n<p>אז הודות לכמה גאונים שחקרו לטרסנפורמצית לורנץ את הצורה, מתברר שאנחנו יודעים לתאר את כל הגדלים ואת כל הטרסנפורמציות שיכולים יחדיו לקיים את הדרישה הזו. יותר מדוייק יהיה לומר שמצאנו את כל משוואות הגלים היחסותיות. הסיבה שזה נכון רק למשוואות גלים היא שתמיד נוכל להמציא עוד גדלים שלא תלויים בטרנספורמצית לורנץ ולגזור אותם איך שאנחנו רוצים. הנגזרת של חמפרפור לפי שלופלישלופ היא חמפרפור בריבוע בכל מערכת ייחוס, וזו משוואה יחסותית. אבל כשאנחנו עוסקים בנגזרות זמניות ומרחביות, מספר המשוואות האפשריות מוגבל ביותר. מדובר כמובן באינסוף משוואות, אבל האינסוף הזה הוא אינסוף משוואות מאוד ספציפיות, שנקראות משוואות ברגמן-וויגנר.  </p>\n<p>בפוסטים הבאים אני אראה במפורש משוואה כזו, אבל זה לא נחוץ כרגע. מה שחשוב הוא שהמטרה ברורה - איך אפשר להשתמש במשוואות ברגמן-וויגנר היחסותיות, כדי לכתוב תאוריה קוונטית על גבי מרחב הילברט?</p>\n<p>כל זאת ועוד, בפרק הבא.</p>\n<!-- [salted duck eggs](http://en.wikipedia.org/wiki/Salted_duck_egg). -->\n<!--\n> A salted duck egg is a Chinese preserved food product made by soaking duck\n> eggs in brine, or packing each egg in damp, salted charcoal. In Asian\n> firm-textured, round yolk that is bright orange-red in color.\n -->\n<!-- ![Chinese Salty Egg](./salty_egg.jpg) -->","frontmatter":{"title":"מבוא לתורת השדות חלק א׳","date":"April 28, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/QFT-part-1/","previous":null,"next":{"fields":{"slug":"/QFT-part-2/"},"frontmatter":{"title":"מבוא לתורת השדות חלק ב׳"}}}}